MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512H.atdf
         <module id="00788" name="DDPSTAT" version="">
            <instance name="DDPSTAT">
               <register-group address-space="periph2" name="DDPSTAT" name-in-module="DDPSTAT" offset="0x1f880140" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00735" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph2" name="DMAC" name-in-module="DMAC" offset="0x1f883000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01114" name="ETH" version="">
            <instance name="ETH">
               <register-group address-space="periph3" name="ETH" name-in-module="ETH" offset="0x1f889000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00774" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph0" name="I2C" name-in-module="I2C" offset="0x1f804ff4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C5">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <register-group address-space="periph0" name="ICAP" name-in-module="ICAP" offset="0x1f801ff4" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
         </module>
         <module id="01166" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph2" name="INT" name-in-module="INT" offset="0x1f881000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00761" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph1" name="NVM" name-in-module="NVM" offset="0x1f80f400" />
               <parameters>
                  <param name="PAGE_SIZE" value="4096"/>
                  <param name="ROW_SIZE" value="512"/>
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph0" name="OCMP" name-in-module="OCMP" offset="0x1f802ff4" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
         </module>
         <module id="01095" name="OSC" version="">
            <instance name="OSC">
               <register-group address-space="periph1" name="OSC" name-in-module="OSC" offset="0x1f80f000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00815" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph2" name="PCACHE" name-in-module="PCACHE" offset="0x1f884000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph0" name="PMP" name-in-module="PMP" offset="0x1f806ff4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
