MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512H.atdf
         <register caption="USB Endpoint 1 Control Register" name="U1EP1" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP1__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP1__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP1__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP1__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP1__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 2 Control Register" name="U1EP2" offset="0x2e0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP2__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP2__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP2__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP2__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP2__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 3 Control Register" name="U1EP3" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP3__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP3__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP3__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP3__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP3__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 4 Control Register" name="U1EP4" offset="0x300" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP4__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP4__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP4__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP4__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP4__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 5 Control Register" name="U1EP5" offset="0x310" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP5__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP5__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP5__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP5__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP5__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 6 Control Register" name="U1EP6" offset="0x320" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP6__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP6__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP6__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP6__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP6__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 7 Control Register" name="U1EP7" offset="0x330" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP7__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP7__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP7__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP7__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP7__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 8 Control Register" name="U1EP8" offset="0x340" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP8__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP8__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP8__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP8__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP8__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 9 Control Register" name="U1EP9" offset="0x350" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP9__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP9__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP9__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP9__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP9__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 10 Control Register" name="U1EP10" offset="0x360" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP10__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP10__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP10__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP10__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP10__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 11 Control Register" name="U1EP11" offset="0x370" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP11__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP11__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP11__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP11__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP11__EPCONDIS" />
         </register>
         <register caption="USB Endpoint 12 Control Register" name="U1EP12" offset="0x380" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP12__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP12__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP12__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP12__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP12__EPCONDIS" />
         </register>
